chore: sync vault updates 2026-03-02-1317
